README.md
```mermaid
graph TB
  User -->|message| TelegramServer
  subgraph "PipeDream Service";

    pipeTelegram --> checkType
    checkType -->|youtube| GetTranscript
    checkType -->|URL| GetHTML
    checkType -->|text| PipePython

    GetHTML --> PipePython
    GetTranscript --> PipePython
    PipePython --> checkCommand
    checkCommand -->|/add| pipeEmail
  end
  
  OpenAI([OpenAI])
  checkCommand -->|/sum| OpenAI
  checkCommand -->|/ask| OpenAI
  TelegramServer --> pipeTelegram
  OpenAI --> pipeEmail
  pipeEmail -->|HTML| Omnivore
```
